{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "65958379",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pyspark.sql import SparkSession"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "fd36ff08",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3.5.3\n"
     ]
    }
   ],
   "source": [
    "import pyspark\n",
    "\n",
    "print(pyspark.__version__)  # VERSION MUST MATCH THE SPARK CONTAINER VERSION"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "42a529f7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'LinkPrediction-2762657871'"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "NEO4J_URI = \"bolt://neo4j:password@neo4j:7687\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "1f720d16",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "            <div>\n",
       "                <p><b>SparkSession - in-memory</b></p>\n",
       "                \n",
       "        <div>\n",
       "            <p><b>SparkContext</b></p>\n",
       "\n",
       "            <p><a href=\"http://cb19395d3b76:4040\">Spark UI</a></p>\n",
       "\n",
       "            <dl>\n",
       "              <dt>Version</dt>\n",
       "                <dd><code>v3.5.3</code></dd>\n",
       "              <dt>Master</dt>\n",
       "                <dd><code>spark://spark:7077</code></dd>\n",
       "              <dt>AppName</dt>\n",
       "                <dd><code>LinkPrediction</code></dd>\n",
       "            </dl>\n",
       "        </div>\n",
       "        \n",
       "            </div>\n",
       "        "
      ],
      "text/plain": [
       "<pyspark.sql.session.SparkSession at 0x7f2941348210>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "spark = (\n",
    "    SparkSession.builder.appName(\"LinkPrediction\")\n",
    "    .master(\"spark://spark:7077\")\n",
    "    .config(\"spark.jars.packages\", \"neo4j-contrib:neo4j-spark-connector:5.3.1-s_2.12\")\n",
    "    .config(\"neo4j.url\", NEO4J_URI)\n",
    "    .config(\"neo4j.authentication.basic.username\", \"neo4j\")\n",
    "    .config(\"neo4j.authentication.basic.password\", \"password\")\n",
    "    .config(\"neo4j.database\", \"neo4j\")\n",
    "    .getOrCreate()\n",
    ")\n",
    "spark"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "a71a3fa2",
   "metadata": {},
   "outputs": [],
   "source": [
    "n1 = \"Francesca Nannetti\"\n",
    "n2 = \"Maria Cassese\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "b83a5115",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.40242960438184466"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "id1, id2 = 5640, 1476\n",
    "result = (\n",
    "    spark.read.format(\"org.neo4j.spark.DataSource\")\n",
    "    .option(\n",
    "        \"query\",\n",
    "        f\"\"\"\n",
    "        MATCH (p1:Person) WHERE id(p1) = {id1}\n",
    "        MATCH (p2:Person) WHERE id(p2) = {id2}\n",
    "        RETURN gds.alpha.linkprediction.adamicAdar(p1, p2) AS score\n",
    "        \"\"\",\n",
    "    )\n",
    "    .option(\"partitions\", \"1\")\n",
    "    .load()\n",
    "    .first()[\"score\"]\n",
    ")\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ec904220",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1.0"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Use this to find the number of papers co-authored by both individuals.\n",
    "\n",
    "result = (\n",
    "    spark.read.format(\"org.neo4j.spark.DataSource\")\n",
    "    .option(\n",
    "        \"query\",\n",
    "        f\"\"\"\n",
    "        MATCH (p1:Person) WHERE id(p1) = {id1}\n",
    "        MATCH (p2:Person) WHERE id(p2) = {id2}\n",
    "        RETURN gds.alpha.linkprediction.commonNeighbors(p1, p2) AS score\n",
    "        \"\"\",\n",
    "    )\n",
    "    .option(\"partitions\", \"1\")\n",
    "    .load()\n",
    "    .first()[\"score\"]\n",
    ")\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d70e2b04",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
